CSI API ETABS v1
cPropFrameSDShape.GetReinfEdge Method
 Retrieves edge reinforcing data for solid rectangle, circle, polygon, and rectangular reinforcing shapes in a section designer property
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetReinfEdge(
	string Name,
	string ShapeName,
	ref int NumberItems,
	ref int[] EdgeNum,
	ref string[] RebarSize,
	ref double[] Spacing,
	ref double[] Cover
)
Function GetReinfEdge (
	Name As String,
	ShapeName As String,
	ByRef NumberItems As Integer,
	ByRef EdgeNum As Integer(),
	ByRef RebarSize As String(),
	ByRef Spacing As Double(),
	ByRef Cover As Double()
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim NumberItems As Integer
Dim EdgeNum As Integer()
Dim RebarSize As String()
Dim Spacing As Double()
Dim Cover As Double()
Dim returnValue As Integer
returnValue = instance.GetReinfEdge(Name,
	ShapeName, NumberItems, EdgeNum,
	RebarSize, Spacing, Cover)
int GetReinfEdge(
	String^ Name,
	String^ ShapeName,
	int% NumberItems,
	array<int>^% EdgeNum,
	array<String^>^% RebarSize,
	array<double>^% Spacing,
	array<double>^% Cover
)
abstract GetReinfEdge :
        Name : string *
        ShapeName : string *
        NumberItems : int byref *
        EdgeNum : int[] byref *
        RebarSize : string[] byref *
        Spacing : float[] byref *
        Cover : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of an existing solid rectangle shape in the specified frame section property
NumberItems
Type: System.Int32
 The number of edges in the shape
EdgeNum
Type: System.Int32[]
 This is an array that includes the edge number in the shape
RebarSize
Type: System.String[]
 This is an array that includes None or the name of a defined rebar, indicating the rebar assignment to the considered edge
Spacing
Type: System.Double[]
 This is an array that includes the rebar maximum center-to-center along the considered edge. [L]
Cover
Type: System.Double[]
 This is an array that includes the rebar clear cover along the considered edge. [L]
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace